<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Драйвер базы данных
    |--------------------------------------------------------------------------
    |
    | Поддерживаемые драйверы: mysql, pgsql, sqlite. Указывает СУБД,
    | к которой подключается приложение.
    |
    */

    'driver' => env('DB_DRIVER', 'mysql'),

    /*
    |--------------------------------------------------------------------------
    | Подключение
    |--------------------------------------------------------------------------
    |
    | Реквизиты подключения к серверу базы данных: адрес сервера, имя базы
    | и учётные данные пользователя. Для драйвера sqlite host/username/
    | password игнорируются, а в database указывается путь к файлу .sqlite.
    |
    */

    'host' => env('DB_HOST', '127.0.0.1'),
    'database' => env('DB_DATABASE', 'govorun'),
    'username' => env('DB_USERNAME', 'root'),
    'password' => env('DB_PASSWORD', ''),
];
